Repository: techiaith/nvda-addon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: cy

source: Welsh Neural Voices - First Time Setup This addon requires Welsh voice data to function. Download details: • Size: Approximately 77 MB • Voice: Welsh multi-speaker neural voice (medium quality, 3 speakers) • Internet connection required NVDA will restart automatically after the download completes. Would you like to download the Welsh voices now?
cy: Lleisiau Niwral Cymraeg - Gosodiad Tro Cyntaf Mae'r ychwanegyn hwn angen data llais Cymraeg i weithio. Manylion lawrlwytho: • Maint: Tua 77 MB • Llais: Llais niwral aml-siaradwr Cymraeg (ansawdd canolig, 3 siaradwr) • Mae angen cysylltiad rhyngrwyd Bydd NVDA yn ailgychwyn yn awtomatig ar ôl i'r lawrlwythiad gwblhau. Hoffech chi lawrlwytho'r lleisiau Cymraeg nawr?

source: Download Welsh Voices?
cy: Lawrlwytho Lleisiau Cymraeg?

source: You can download Welsh voices later from: NVDA Menu → Preferences → Settings → Speech → Select 'Uned Technolegau Iaith - Welsh Neural Voices' as your synthesizer. The addon will not function until voices are downloaded.
cy: Gallwch lawrlwytho lleisiau Cymraeg yn ddiweddarach o: Dewislen NVDA → Dewisiadau → Gosodiadau → Lleferydd → Dewiswch 'Uned Technolegau Iaith - Welsh Neural Voices' fel eich syntheseiddydd. Ni fydd yr ychwanegyn yn gweithio nes bod lleisiau wedi'u lawrlwytho.

source: Welsh Voices Not Downloaded
cy: Lleisiau Cymraeg Heb Eu Lawrlwytho

source: No Welsh voices are available for download. Please check your internet connection and try again.
cy: Dim lleisiau Cymraeg ar gael i'w lawrlwytho. Gwiriwch eich cysylltiad rhyngrwyd a rhowch gynnig arall arni.

source: Error Downloading Welsh Voices
cy: Gwall wrth Lawrlwytho Lleisiau Cymraeg

source: Failed to download Welsh voices automatically. Error: {error} Please check NVDA's log for more details.
cy: Methu lawrlwytho lleisiau Cymraeg yn awtomatig. Gwall: {error} Gwiriwch log NVDA am fwy o fanylion.

source: OK
cy: Iawn

source: Cancel
cy: Canslo

source: Downloaded: {progress}%
cy: Wedi lawrlwytho: {progress}%

source: Installing voice
cy: Yn gosod llais

source: Cannot download voice {voice}. Please check your connection and try again.
cy: Methu lawrlwytho llais {voice}. Gwiriwch eich cysylltiad a rhowch gynnig arall arni.

source: Download failed
cy: Methwyd lawrlwytho

source: Welsh voices have been downloaded successfully! NVDA needs to restart to load the new voices. Click OK to restart NVDA now.
cy: Mae lleisiau Cymraeg wedi'u lawrlwytho'n llwyddiannus! Mae angen i NVDA ailgychwyn i lwytho'r lleisiau newydd. Cliciwch Iawn i ailgychwyn NVDA nawr.

source: Download Complete
cy: Lawrlwythiad Wedi'i Gwblhau

source: Downloading voice {voice}
cy: Yn lawrlwytho llais {voice}

source: Retrieving download information...
cy: Yn cyrchu gwybodaeth lawrlwytho...

source: Downloading file: {file}
cy: Yn lawrlwytho ffeil: {file}

source: Installed voices
cy: Lleisiau wedi'u gosod

source: Name
cy: Enw

source: Quality
cy: Ansawdd

source: Language
cy: Iaith

source: &Voice model card...
cy: &Cerdyn model llais...

source: &Remove voice...
cy: &Dileu llais...

source: Install from local file
cy: Gosod o ffeil leol

source: Install a voice from a local archive. The archive contains the voice model and configuration. The archive should have a (.tar.gz) file extension.
cy: Gosod llais o archif leol. Mae'r archif yn cynnwys model llais a chyfluniad. Dylai'r archif fod ag estyniad ffeil (.tar.gz).

source: Model card
cy: Cerdyn model

source: Model card information is unavailable for this voice
cy: Nid yw gwybodaeth cerdyn model ar gael ar gyfer y llais hwn

source: Not found
cy: Heb ei ganfod

source: You cannot remove the currently active voice!
cy: Ni allwch ddileu'r llais sy'n weithredol ar hyn o bryd!

source: Error
cy: Gwall

source: Do you want to remove this voice? Voice: {name}
cy: Ydych chi eisiau dileu'r llais hwn? Llais: {name}

source: Remove voice?
cy: Dileu llais?

source: Failed to remove voice. See NVDA's log for more details.
cy: Methwyd dileu'r llais. Gweler log NVDA am fwy o fanylion.

source: Failed
cy: Methwyd

source: Voice removed successfully.
cy: Llais wedi'i ddileu'n llwyddiannus.

source: Done
cy: Wedi gorffen

source: Choose voice archive file
cy: Dewiswch ffeil archif llais

source: Failed to install voice from archive. See NVDA's log for more details.
cy: Methwyd gosod llais o'r archif. Gweler log NVDA am fwy o fanylion.

source: Voice installation failed
cy: Methwyd gosod y llais

source: Voice {voice} has been installed successfully.
cy: Mae llais {voice} wedi'i osod yn llwyddiannus.

source: Voice installed successfully
cy: Llais wedi'i osod yn llwyddiannus

source: Available voices
cy: Lleisiau sydd ar gael

source: Preview
cy: Rhagolwg

source: Speaker
cy: Siaradwr

source: &Preview
cy: &Rhagolwg

source: &Download standard variant
cy: &Lawrlwytho amrywiad safonol

source: Download &fast variant
cy: Lawrlwytho amrywiad &cyflym

source: &Refresh voices list
cy: &Adnewyddu rhestr lleisiau

source: Retrieving voices list. Please wait...
cy: Yn cyrchu rhestr lleisiau. Arhoswch...

source: Could not retrieve voice list. Please check your connection and try again.
cy: Methu cyrchu rhestr lleisiau. Gwiriwch eich cysylltiad a rhowch gynnig arall arni.

source: Playing preview...
cy: Yn chwarae rhagolwg...

source: Techiaith TTS voice manager
cy: Rheolwr lleisiau TTS Techiaith

source: Installed
cy: Wedi gosod

source: Download
cy: Lawrlwytho

source: &Close
cy: &Cau

source: &Speaker
cy: &Siaradwr

source: &Noise scale
cy: Graddfa &sŵn

source: &Length scale
cy: Graddfa &hyd

source: Noise &w
cy: Sŵn &w

source: Uned Technolegau Iaith - Welsh Neural Voices
cy: Uned Technolegau Iaith - Lleisiau Niwral Cymraeg

source: Automatic Welsh (Cymraeg) neural text-to-speech for NVDA using Piper models. All Welsh voices are downloaded automatically on first run.
cy: Trosi testun-i-lafar niwral Cymraeg awtomatig ar gyfer NVDA gan ddefnyddio modelau Piper. Mae pob llais Cymraeg yn cael ei lawrlwytho'n awtomatig ar y tro cyntaf.
